<!DOCTYPE html>
<html lang="en"><head>
  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1"><!-- Begin Jekyll SEO tag v2.8.0 -->
<title>How to deploy this site | Akira Kawata</title>
<meta name="generator" content="Jekyll v4.3.4" />
<meta property="og:title" content="How to deploy this site" />
<meta property="og:locale" content="en_US" />
<link rel="canonical" href="/memos/reading-inside-windows.html" />
<meta property="og:url" content="/memos/reading-inside-windows.html" />
<meta property="og:site_name" content="Akira Kawata" />
<meta property="og:type" content="website" />
<meta name="twitter:card" content="summary" />
<meta property="twitter:title" content="How to deploy this site" />
<script type="application/ld+json">
{"@context":"https://schema.org","@type":"WebPage","headline":"How to deploy this site","url":"/memos/reading-inside-windows.html"}</script>
<!-- End Jekyll SEO tag -->
<link rel="stylesheet" href="/assets/main.css"><link type="application/atom+xml" rel="alternate" href="/feed.xml" title="Akira Kawata" /></head>
<body><header class="site-header">

  <div class="wrapper"><a class="site-title" rel="author" href="/">Akira Kawata</a><nav class="site-nav">
        <input type="checkbox" id="nav-trigger" class="nav-trigger" />
        <label for="nav-trigger">
          <span class="menu-icon">
            <svg viewBox="0 0 18 15" width="18px" height="15px">
              <path d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0 h15.032C17.335,0,18,0.665,18,1.484L18,1.484z M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0 c0-0.82,0.665-1.484,1.484-1.484h15.032C17.335,6.031,18,6.696,18,7.516L18,7.516z M18,13.516C18,14.335,17.335,15,16.516,15H1.484 C0.665,15,0,14.335,0,13.516l0,0c0-0.82,0.665-1.483,1.484-1.483h15.032C17.335,12.031,18,12.695,18,13.516L18,13.516z"/>
            </svg>
          </span>
        </label>
      </nav></div>
</header>

<main class="page-content" aria-label="Content">
      <div class="wrapper">
        <h1 id="インサイド-windows-読書メモ">インサイド Windows 読書メモ</h1>

<h2 id="カーネルデバッガを使えるようにする方法">カーネルデバッガを使えるようにする方法</h2>
<ul>
  <li>仮想マシンを作る
    <ul>
      <li><a href="https://learn.microsoft.com/ja-jp/virtualization/hyper-v-on-windows/quick-start/create-virtual-machine">Windows での Hyper-V による仮想マシンの作成</a></li>
    </ul>
  </li>
  <li>仮想マシンのアドレスは固定する
    <ul>
      <li>ここでは <code class="language-plaintext highlighter-rouge">192.168.11.90</code> にする</li>
    </ul>
  </li>
  <li>ファイアウォールに穴を開ける
    <ul>
      <li><a href="https://bluehircine.wordpress.com/2012/08/21/%E7%89%B9%E5%AE%9A%E3%81%AEip%E3%82%A2%E3%83%89%E3%83%AC%E3%82%B9%E3%81%A8%E3%81%AE%E9%80%9A%E4%BF%A1%E3%82%92%E5%85%A8%E3%81%A6%E8%A8%B1%E5%8F%AF%E3%81%99%E3%82%8B%E3%82%88%E3%81%86%E3%80%81%E3%82%BB/">特定のIPアドレスとの通信を全て許可するよう、セキュリティが強化されたWindowsファイアウォールを設定。</a></li>
      <li>ローカルIP は <code class="language-plaintext highlighter-rouge">192.168.11.0/24</code></li>
      <li>リモートIP は <code class="language-plaintext highlighter-rouge">192.168.11.90</code></li>
    </ul>
  </li>
  <li>ゲストマシン、ホストマシンに <a href="https://learn.microsoft.com/ja-jp/windows-hardware/drivers/download-the-wdk">Windows Driver Kit (WDK) のダウンロード</a> から WDK をインストールする</li>
  <li><a href="https://learn.microsoft.com/ja-jp/windows-hardware/drivers/debugger/setting-up-network-debugging-of-a-virtual-machine-host">仮想マシンのネットワーク デバッグの設定 - KDNET</a>
    <ul>
      <li>ゲストマシンで
        <ul>
          <li><code class="language-plaintext highlighter-rouge">C:\KDNET</code> に移動</li>
          <li><code class="language-plaintext highlighter-rouge">kdnet 192.168.11.15 50005</code> を実行</li>
        </ul>
      </li>
      <li>ホストマシンで <code class="language-plaintext highlighter-rouge">"C:\Program Files (x86)\Windows Kits\10\Debuggers\x64\windbg.exe"  -k net:port=50005,key=...</code> を実行</li>
      <li>ゲストマシンで <code class="language-plaintext highlighter-rouge">shutdown -r -t 0</code> を実行して再起動</li>
    </ul>
  </li>
  <li>そのままだと <code class="language-plaintext highlighter-rouge">Debuggee is running</code> となって何もできないので Debug -&gt; Break で止めると以下のような画面になるので <code class="language-plaintext highlighter-rouge">0: kd&gt;</code> の右のところにコマンドを打つ</li>
</ul>

<div class="language-plaintext highlighter-rouge"><div class="highlight"><pre class="highlight"><code>*******************************************************************************
*                                                                             *
*   You are seeing this message because you pressed either                    *
*       CTRL+C (if you run console kernel debugger) or,                       *
*       CTRL+BREAK (if you run GUI kernel debugger),                          *
*   on your debugger machine's keyboard.                                      *
*                                                                             *
*                   THIS IS NOT A BUG OR A SYSTEM CRASH                       *
*                                                                             *
* If you did not intend to break into the debugger, press the "g" key, then   *
* press the "Enter" key now.  This message might immediately reappear.  If it *
* does, press "g" and "Enter" again.                                          *
*                                                                             *
*******************************************************************************
nt!DbgBreakPointWithStatus:
fffff804`6cc201d0 cc              int     3
</code></pre></div></div>
<div class="language-plaintext highlighter-rouge"><div class="highlight"><pre class="highlight"><code>0: kd&gt;
</code></pre></div></div>

<ul>
  <li>例えば <code class="language-plaintext highlighter-rouge">dt nt!_KINTERRUPT</code> などと打つと以下のようになる</li>
</ul>

<div class="language-plaintext highlighter-rouge"><div class="highlight"><pre class="highlight"><code>0: kd&gt; dt nt!_KINTERRUPT
   +0x000 Type             : Int2B
   +0x002 Size             : Int2B
   +0x008 InterruptListEntry : _LIST_ENTRY
   +0x018 ServiceRoutine   : Ptr64     unsigned char 
   +0x020 MessageServiceRoutine : Ptr64     unsigned char 
   +0x028 MessageIndex     : Uint4B
   +0x030 ServiceContext   : Ptr64 Void
   +0x038 SpinLock         : Uint8B
   +0x040 TickCount        : Uint4B
   +0x048 ActualLock       : Ptr64 Uint8B
   +0x050 DispatchAddress  : Ptr64     void 
   +0x058 Vector           : Uint4B
   +0x05c Irql             : UChar
   +0x05d SynchronizeIrql  : UChar
   +0x05e FloatingSave     : UChar
   +0x05f Connected        : UChar
   +0x060 Number           : Uint4B
   +0x064 ShareVector      : UChar
   +0x065 EmulateActiveBoth : UChar
   +0x066 ActiveCount      : Uint2B
   +0x068 InternalState    : Int4B
   +0x06c Mode             : _KINTERRUPT_MODE
   +0x070 Polarity         : _KINTERRUPT_POLARITY
   +0x074 ServiceCount     : Uint4B
   +0x078 DispatchCount    : Uint4B
   +0x080 PassiveEvent     : Ptr64 _KEVENT
   +0x088 TrapFrame        : Ptr64 _KTRAP_FRAME
   +0x090 DisconnectData   : Ptr64 Void
   +0x098 ServiceThread    : Ptr64 _KTHREAD
   +0x0a0 ConnectionData   : Ptr64 _INTERRUPT_CONNECTION_DATA
   +0x0a8 IntTrackEntry    : Ptr64 Void
   +0x0b0 IsrDpcStats      : _ISRDPCSTATS
   +0x110 RedirectObject   : Ptr64 Void
   +0x118 Padding          : [8] UChar
</code></pre></div></div>

      </div>
    </main><footer class="site-footer h-card">
</footer>
</body>

</html>
